Returns a LightShapeStyle value for the light shape
  Namespace:   Autodesk.Revit.DB.Lighting
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public LightShapeStyle GetLightShapeStyle()
  Visual Basic
Public Function GetLightShapeStyle As LightShapeStyle
  Visual C++
public:
LightShapeStyle GetLightShapeStyle()
 See Also
  LightFamily Class
  Autodesk.Revit.DB.Lighting Namespace